# ActLayer

## Description
Function ActLayer returns a handle to the currently active layer in a document.

```pascal
FUNCTION ActLayer : HANDLE;
```

```python

def vs.ActLayer():
    return HANDLE
```

## See Also
VS Functions:
ActiveClass| ActSymDef| GetLName

## Version
Availability: from MiniCAD
## Category
* Layers